In [2]:
import pandas as pd
import numpy as np
from numpy.random import randn

In [3]:
np.random.seed(1)

In [4]:

df  =  pd.DataFrame(randn(4, 5),[1, 2, 3, 4], ['A', 'B', 'C', 'D', 'E'])
df

          A         B         C         D         E
1  1.624345 -0.611756 -0.528172 -1.072969  0.865408
2 -2.301539  1.744812 -0.761207  0.319039 -0.249370
3  1.462108 -2.060141 -0.322417 -0.384054  1.133769
4 -1.099891 -0.172428 -0.877858  0.042214  0.582815

In [5]:
df[:1]

          A         B         C         D         E
1  1.624345 -0.611756 -0.528172 -1.072969  0.865408

In [6]:
df['New'] = df['A'] + df['B']
df

          A         B         C         D         E       New
1  1.624345 -0.611756 -0.528172 -1.072969  0.865408  1.012589
2 -2.301539  1.744812 -0.761207  0.319039 -0.249370 -0.556727
3  1.462108 -2.060141 -0.322417 -0.384054  1.133769 -0.598033
4 -1.099891 -0.172428 -0.877858  0.042214  0.582815 -1.272319

In [7]:
df.drop('New', axis=1, inplace=True)

In [8]:
df

          A         B         C         D         E
1  1.624345 -0.611756 -0.528172 -1.072969  0.865408
2 -2.301539  1.744812 -0.761207  0.319039 -0.249370
3  1.462108 -2.060141 -0.322417 -0.384054  1.133769
4 -1.099891 -0.172428 -0.877858  0.042214  0.582815

In [9]:
df.shape

(4, 5)

In [10]:
df[['A', 'B']]

          A         B
1  1.624345 -0.611756
2 -2.301539  1.744812
3  1.462108 -2.060141
4 -1.099891 -0.172428

In [11]:
df.loc[1]

A    1.624345
B   -0.611756
C   -0.528172
D   -1.072969
E    0.865408
Name: 1, dtype: float64

In [12]:
df.iloc[0]

A    1.624345
B   -0.611756
C   -0.528172
D   -1.072969
E    0.865408
Name: 1, dtype: float64

In [13]:
df

          A         B         C         D         E
1  1.624345 -0.611756 -0.528172 -1.072969  0.865408
2 -2.301539  1.744812 -0.761207  0.319039 -0.249370
3  1.462108 -2.060141 -0.322417 -0.384054  1.133769
4 -1.099891 -0.172428 -0.877858  0.042214  0.582815

In [14]:
df['A']

1    1.624345
2   -2.301539
3    1.462108
4   -1.099891
Name: A, dtype: float64